import sys

投币 = int(input("请投币: ")) 	#从键盘输入一个0～5之间的整数.
while True:
  if 投币 == 0:     			#退出程序.
    print("叮咚: 设备停止工作！")
    break     				#或使用sys.exit()语句退出程序.
  elif 投币 == 1:   			#输入为1，对应"冰露纯净水".
    叮咚 = "冰露纯净水"
  elif 投币 == 2:   			#输入为2，对应"农夫山泉矿泉水".
    叮咚 = "农夫山泉矿泉水"
  elif 投币 == 3:   			#输入为3，对应"冰红茶".
    叮咚 = "冰红茶"
  elif 投币 == 4:   			#输入为4，对应"脉动".
    叮咚 = "脉动"
  elif 投币==5:     			#输入为5，对应"红牛".
    叮咚 = "红牛"
  else:            				#输入错误，提示重新输入.
    叮咚 = "投币错误！请重新投币..."
  print("叮咚:",叮咚)
  投币 = int(input("请投币: "))
